# 중첩 for문

# **********
# **********
# **********
# **********
# **********
# **********
# **********
# **********
# **********
# **********

######################
print("반복문 없이 출력")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")

print("--------------------")

######################
# for 1개를 이용하여 사각형 출력
for i in range(1, 11, 1):
    print("**********")


print("--------------------")
######################
# for 2개를 이용하여 사각형 출력

for i in range(1, 11, 1):
    x = ""
    for t in range(1, 11, 1):
        x = x + "*"
    print(x)


print("--------------------")
######################
# for 2개를 이용하여 직각 삼각형 출력(문자열 이용)

print("------for 2개를 이용하여 직각 삼각형 출력:(문자열 이용) --------------")

for i in range(1, 11, 1):
    x = ""
    for t in range(1, i+1, 1):
        x = x + "*"
    print(x)


print("--------------------")

# for 2개를 이용하여 직각 삼각형 출력(프린트문만 이용)

for i in range(1, 11, 1):
    for t in range(1, i+1, 1):
        print("*", end="")
    print("")

print("--------------------")
######################
# for 2개를 이용하여 역삼각형 출력(문자열 이용)
for i in range(11, 0, -1):
    x = ""
    for t in range(11, 0, -1):
        x =  " " + "*"*i
    print(x)

print("--------------------")

for i in range(1, 11, 1):
    for t in range(1, i+1, 1):
        print(" ", end="")  # 공백출력
    for t in range(i+1, 11, 1):
        print("*", end="")  # 별표출력

    print()  # 줄바뀜
print("--------------------")
