
############################
# 리스트의 CRUD3S
# C: create.
# R: read
# U: update
# D: delete
# S: search
# S: sort
# S: shuffle
############################


############################
# 리스트 선언
# 리스트에는 다 담을 수 있다. 함수도 담을 수 있다. 
############################

############################
# 문자 H, e, l, l, o를 요소로 가지는 리스트
# 문자열 Hello를 요소로 가지는 리스트
# 문자열을 리스트로 변환. 문자 H, e, l, l, o를 요소로 가지는 리스트 생성
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
############################



############################
# 리스트 요소 출력
# 리스트의 시작은 0번부터다. 
# 리스트  Read : [] 선택 연산자를 사용한다.
############################

############################
# 리스트 전체 출력
############################

############################
# 리스트 슬라이싱 : 
# 1. 선택 연산자 사용하는 방법.
############################


############################
# 리스트 요소 대입
# 리스트의 0번 값을 문자열 "변경"값으로 바꾸시오.
############################


############################
# 리스트 요소 추가: C. create
#  추가 : 리스트의 마지막에 넣는다. --> .append() 메서드 사용
#  삽입 : 리스트의 중간에 넣는다.   --> .insert() 메서드 사용
############################ 


############################
# 리스트 요소 삭제: D. deletef
#  메서드 방식 --> pop() 메서드 . 추천
#  연산자 방식 --> del. 비추천 
############################

############################
# 리스트 열거
############################


############################
# 리스트에 담을 수 있는 것은? ==> 다
# 리스트 선언 ==> [] , list()
# 리스트 추가(C) ==> .append(), .insert()
# 리스트 읽기(R) ==> [방번호]
# 리스트 수정(U) ==> [방번호] = 값
# 리스트 삭제(D) ==> .pop()
# 리스트 정렬(S) ==> sorted()
# 리스트 정렬(S) ==> .find() + 반복문 , .rfind() + 반복문 
# 리스트 길이    ==> len()
# 리스트 출력 
# 리스트 열거
############################
